// version.js
const VERSION_DATA = {
  versions: [
    {
      version: "v0.25.2",
      date: "2026-08-24",
      changes: [
        "✨ 新增系別篩選",
        "🔧 區分海盔蟲和地鼠兩個樣子",
        "🔧 在窩位卡片內顯示精靈系別",
        "🐛 當重新整理推薦時不會再從已匯入資料讀取優先孵化賽季",
        "🐛 解決一些已知問題"
      ]
    },
    {
      version: "v0.25.1",
      date: "2026-08-19",
      changes: [
        "✨ 新增查看版本更新紀錄功能",
        "✨ 新增日間夜間模式切換",
        "🔧 將排除清單和願望清單移至窩位卡片內",
        "🐛 改善優先孵化賽季選擇器手機端顯示",
        "🐛 解決一些已知問題"
      ]
    },
    {
      version: "v0.25.0",
      date: "2026-08-19",
      changes: [
        "✨ 新增優先孵化賽季功能",
        "🐛 解決一些已知問題"
      ]
    }
  ]
};
